## Example queries and query results

**Requirements:** You must run `python create_tables.py` and `etl.py` before using this notebook.

In [5]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [7]:
%sql SELECT song_id, COUNT(*) AS count FROM songplays GROUP BY song_id ORDER BY count

 * postgresql://student:***@127.0.0.1/sparkifydb
2 rows affected.

[('SOZCTXZ12AB0182364', 1), (None, 6819)]

In [8]:
%%sql 
-- Which songs are played most often?

SELECT 
t.song_id,
ss.title,
count 
FROM (
    SELECT 
    sps.song_id, 
    COUNT(*) AS count 
    FROM songplays AS sps
    LEFT JOIN songs AS ss ON sps.song_id = ss.song_id
    GROUP BY sps.song_id
    ORDER BY count
) t
LEFT JOIN songs ss ON t.song_id = ss.song_id;

 * postgresql://student:***@127.0.0.1/sparkifydb
2 rows affected.

[('SOZCTXZ12AB0182364', 'Setanta matins', 1), (None, None, 6819)]

In [9]:
%%sql 
-- Which top five users (by their id) have played the most songs?

SELECT 
ss.user_id AS user_id,
COUNT(*) AS count 
FROM songplays ss
GROUP BY ss.user_id
ORDER BY count DESC
LIMIT 5

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(49, 689), (80, 665), (97, 557), (15, 463), (44, 397)]

In [10]:
%%sql 
-- Which top five users (by their full name) have played the most songs?

SELECT 
CONCAT(users.first_name, ' ', users.last_name) AS full_name,
count
FROM
(
    SELECT 
    ss.user_id AS user_id,
    COUNT(*) AS count 
    FROM songplays ss
    GROUP BY ss.user_id
    ORDER BY count 
    DESC LIMIT 5
) t
JOIN users ON t.user_id = users.user_id 
GROUP BY count, users.first_name, users.last_name
ORDER BY count DESC
LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('Chloe Cuevas', 689),
 ('Tegan Levine', 665),
 ('Kate Harrell', 557),
 ('Lily Koch', 463),
 ('Aleena Kirby', 397)]

In [17]:
%%sql 
-- From which location are most songs played? 

SELECT 
  location, 
    COUNT(*) AS count 
FROM songplays 
GROUP BY location 
ORDER BY count DESC 
LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('San Francisco-Oakland-Hayward, CA', 691),
 ('Portland-South Portland, ME', 665),
 ('Lansing-East Lansing, MI', 557),
 ('Chicago-Naperville-Elgin, IL-IN-WI', 475),
 ('Atlanta-Sandy Springs-Roswell, GA', 456)]

In [16]:
%%sql 
-- Which user client was used most often to play songs?

SELECT 
  user_agent, 
    COUNT(*) AS count 
FROM songplays 
GROUP BY 
user_agent ORDER BY count 
DESC LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"', 971),
 ('"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"', 708),
 ('Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0', 696),
 ('"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"', 577),
 ('"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"', 573)]

In [15]:
%%sql
-- At which hour of day were the most songs played?

SELECT 
  time.hour, 
    COUNT(*) AS count 
FROM songplays sps
JOIN time ON sps.timestamp = time.timestamp
GROUP BY time.hour 
ORDER BY count DESC 
LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(16, 544), (18, 500), (17, 496), (15, 477), (14, 436)]